In [1]:
import numpy as np
import pandas as pd

In [3]:
s=pd.Series(np.random.randint(0,10,5))
s

0    2
1    2
2    5
3    2
4    4
dtype: int32

In [4]:
df=pd.DataFrame(np.random.randint(0,10,(3,3)),columns=['A','B','C'])
df

   A  B  C
0  4  1  6
1  9  0  7
2  9  4  3

In [5]:
np.exp(s) # 지수계산

0      7.389056
1      7.389056
2    148.413159
3      7.389056
4     54.598150
dtype: float64

In [6]:
np.cos(df*np.pi/4) #코사인값

          A         B             C
0 -1.000000  0.707107 -1.836970e-16
1  0.707107  1.000000  7.071068e-01
2  0.707107 -1.000000 -7.071068e-01

In [8]:
s1=pd.Series([1,3,5,7,9],index=[0,1,2,3,4])
s2=pd.Series([2,4,6,8,10],index=[1,2,3,4,5])
print(s1)
print(s2)

0    1
1    3
2    5
3    7
4    9
dtype: int64
1     2
2     4
3     6
4     8
5    10
dtype: int64

In [9]:
s1+s2 # 서로 겹치는 색인이 없는 경우 데이터는 NA값

0     NaN
1     5.0
2     9.0
3    13.0
4    17.0
5     NaN
dtype: float64

In [10]:
s1.add(s2,fill_value=0) #s1+s2와 같은 기능. fiil_value 메서드로 인해 안겹치는 색인에 0값을 더해준다.

0     1.0
1     5.0
2     9.0
3    13.0
4    17.0
5    10.0
dtype: float64

In [11]:
df1=pd.DataFrame(np.random.randint(0,20,(3,3)),columns=list('ACD'))
df1

   A   C   D
0  9   8  11
1  9  19  14
2  5   3   7

In [12]:
df2=pd.DataFrame(np.random.randint(0,20,(5,5)),columns=list('BAECD'))
df2

    B   A   E   C   D
0   5  18   5  16  11
1   8  17  17  14  19
2  18   9   0   4  10
3  18   8  16   7   8
4  11  17   4   7   6

In [13]:
df1+df2 # DataFrame의 경우 양쪽에 컬럼이나 로우가 다 존재하지 않은경우 nan값을 나타난다.

      A   B     C     D   E
0  27.0 NaN  24.0  22.0 NaN
1  26.0 NaN  33.0  33.0 NaN
2  14.0 NaN   7.0  17.0 NaN
3   NaN NaN   NaN   NaN NaN
4   NaN NaN   NaN   NaN NaN

In [17]:
df1.add(df2, fill_value=5) # Series에서 fill_value와 같은 방법

      A     B     C     D     E
0  27.0  10.0  24.0  22.0  10.0
1  26.0  13.0  33.0  33.0  22.0
2  14.0  23.0   7.0  17.0   5.0
3  13.0  23.0  12.0  13.0  21.0
4  22.0  16.0  12.0  11.0   9.0

## 연산자 범용함수

#### add()

In [23]:
df=pd.DataFrame(a,columns=['a','b','c'])
df

   a  b  c
0  9  8  4
1  5  2  6
2  6  5  9

In [24]:
df+df.iloc[0] #DataFrame과 Series 간의 연산
              # Series의 색인을 DataFrame의 컬럼에 맞추고 아래 로우로 전파

    a   b   c
0  18  16   8
1  14  10  10
2  15  13  13

In [25]:
df.add(df.iloc[0])

    a   b   c
0  18  16   8
1  14  10  10
2  15  13  13

#### sub()/subtract()

In [28]:
df

   a  b  c
0  9  8  4
1  5  2  6
2  6  5  9

In [29]:
# df-df.iloc[0]
#DataFrame과 Series 간의 연산
# Series의 색인을 DataFrame의 컬럼에 맞추고 아래 로우로 전파
df.sub(df.iloc[0])

   a  b  c
0  0  0  0
1 -4 -6  2
2 -3 -3  5

In [31]:
df.subtract(df['b'],axis=0) #DataFrame의 row를 따라 연산을 수행하라는 의미

   a  b  c
0  1  0 -4
1  3  0  4
2  1  0  4

#### mul()/multiply()

In [32]:
df

   a  b  c
0  9  8  4
1  5  2  6
2  6  5  9

In [33]:
df*df.iloc[1]

    a   b   c
0  45  16  24
1  25   4  36
2  30  10  54

In [34]:
df.mul(df.iloc[1])

    a   b   c
0  45  16  24
1  25   4  36
2  30  10  54

In [35]:
df.multiply(df.iloc[0])

    a   b   c
0  81  64  16
1  45  16  24
2  54  40  36

#### truediv()/ div()/ divide()/ floordiv()

In [37]:
df

   a  b  c
0  9  8  4
1  5  2  6
2  6  5  9

In [39]:
df/df.iloc[0]

          a      b     c
0  1.000000  1.000  1.00
1  0.555556  0.250  1.50
2  0.666667  0.625  2.25

In [42]:
df.truediv(df.iloc[0]) #나눗셈 메서드

          a      b     c
0  1.000000  1.000  1.00
1  0.555556  0.250  1.50
2  0.666667  0.625  2.25

In [44]:
df.div(df.iloc[0]) # 나눗셈 메서드

          a      b     c
0  1.000000  1.000  1.00
1  0.555556  0.250  1.50
2  0.666667  0.625  2.25

In [47]:
df.divide(df.iloc[0]) # 나눗셈 메서드

          a      b     c
0  1.000000  1.000  1.00
1  0.555556  0.250  1.50
2  0.666667  0.625  2.25

In [48]:
df.floordiv(df.iloc[0]) #소수점 내림(//) 연산을 위한 메서드

   a  b  c
0  1  1  1
1  0  0  1
2  0  0  2

#### mod()

In [49]:
df

   a  b  c
0  9  8  4
1  5  2  6
2  6  5  9

In [51]:
df.mod(df.iloc[0]) # 나머지를 리턴

   a  b  c
0  0  0  0
1  5  2  2
2  6  5  1

#### pow

In [52]:
df

   a  b  c
0  9  8  4
1  5  2  6
2  6  5  9

In [54]:
df.pow(df.iloc[0]) # 제곱을 위한 메서드

           a         b     c
0  387420489  16777216   256
1    1953125       256  1296
2   10077696    390625  6561

In [55]:
row=df.iloc[0,::2]
row

a    9
c    4
Name: 0, dtype: int32